export const manPhoto = "https://thispersondoesnotexist.com/image";
export const names = ['Нестеров Александр', 'Комаров Иван', 'Давыдов Александр', 'Егоров Арсений', 'Синицына Екатерина', 'Колесникова Регина', 'Иванов Даниил', 'Петров Лев', 'Соколова Стефания', 'Николаева Анфиса', 'Тихомиров Арсений', 'Соколов Павел', 'Парамонова Милана', 'Абрамова Юлия', 'Вдовина Ксения', 'Федорова Полина', 'Мельникова Антонина', 'Иванов Георгий', 'Петрова Елизавета', 'Иванова Амира'];
export const messages = [
    "Господа, высокое качество позиционных исследований предоставляет широкие возможности для существующих финансовых и административных условий. А также стремящиеся вытеснить традиционное производство, нанотехнологии, вне зависимости от их уровня, должны быть рассмотрены исключительно в разрезе маркетинговых и финансовых предпосылок. Банальные, но неопровержимые выводы, а также интерактивные прототипы ограничены исключительно образом мышления.",
    "Задача организации, в особенности же новая модель организационной деятельности предопределяет высокую востребованность поставленных обществом задач. С учётом сложившейся международной обстановки, выбранный нами инновационный путь создаёт необходимость включения в производственный план целого ряда внеочередных мероприятий с учётом комплекса переосмысления внешнеэкономических политик. С другой стороны, разбавленное изрядной долей эмпатии, рациональное мышление, в своём классическом представлении, допускает внедрение поэтапного и последовательного развития общества. Равным образом, перспективное планирование обеспечивает широкому кругу (специалистов) участие в формировании дальнейших направлений развития.",
    "Учитывая ключевые сценарии поведения, сплочённость команды профессионалов позволяет выполнить важные задания по разработке позиций, занимаемых участниками в отношении поставленных задач. Являясь всего лишь частью общей картины, сделанные на базе интернет-аналитики выводы рассмотрены исключительно в разрезе маркетинговых и финансовых предпосылок. Прежде всего, новая модель организационной деятельности позволяет выполнить важные задания по разработке новых принципов формирования материально-технической и кадровой базы. Учитывая ключевые сценарии поведения, перспективное планирование не оставляет шанса для вывода текущих активов.",
    "Также как разбавленное изрядной долей эмпатии, рациональное мышление однозначно определяет каждого участника как способного принимать собственные решения касаемо позиций, занимаемых участниками в отношении поставленных задач. Но явные признаки победы институционализации заблокированы в рамках своих собственных рациональных ограничений. Ясность нашей позиции очевидна: понимание сути ресурсосберегающих технологий требует анализа кластеризации усилий. Есть над чем задуматься: некоторые особенности внутренней политики разоблачены.",
    "Также как убеждённость некоторых оппонентов способствует подготовке и реализации позиций, занимаемых участниками в отношении поставленных задач. Но диаграммы связей, превозмогая сложившуюся непростую экономическую ситуацию, в равной степени предоставлены сами себе.",
    "Противоположная точка зрения подразумевает, что реплицированные с зарубежных источников, современные исследования могут быть обнародованы. Задача организации, в особенности же разбавленное изрядной долей эмпатии, рациональное мышление обеспечивает актуальность своевременного выполнения сверхзадачи. Приятно, граждане, наблюдать, как ключевые особенности структуры проекта будут функционально разнесены на независимые элементы. Есть над чем задуматься: независимые государства неоднозначны и будут представлены в исключительно положительном свете. Картельные сговоры не допускают ситуации, при которой предприниматели в сети интернет являются только методом политического участия и ассоциативно распределены по отраслям. Как принято считать, стремящиеся вытеснить традиционное производство, нанотехнологии призывают нас к новым свершениям, которые, в свою очередь, должны быть разоблачены.",
    "Имеется спорная точка зрения, гласящая примерно следующее: предприниматели в сети интернет лишь добавляют фракционных разногласий и в равной степени предоставлены сами себе. Учитывая ключевые сценарии поведения, граница обучения кадров выявляет срочную потребность распределения внутренних резервов и ресурсов. Высокий уровень вовлечения представителей целевой аудитории является четким доказательством простого факта: глубокий уровень погружения является качественно новой ступенью поэтапного и последовательного развития общества. Имеется спорная точка зрения, гласящая примерно следующее: явные признаки победы институционализации призывают нас к новым свершениям, которые, в свою очередь, должны быть рассмотрены исключительно в разрезе маркетинговых и финансовых предпосылок.",
    "Господа, социально-экономическое развитие создаёт необходимость включения в производственный план целого ряда внеочередных мероприятий с учётом комплекса переосмысления внешнеэкономических политик. Но реплицированные с зарубежных источников, современные исследования будут заблокированы в рамках своих собственных рациональных ограничений. Противоположная точка зрения подразумевает, что ключевые особенности структуры проекта, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Вот вам яркий пример современных тенденций — новая модель организационной деятельности предоставляет широкие возможности для направлений прогрессивного развития. Безусловно, дальнейшее развитие различных форм деятельности способствует подготовке и реализации системы обучения кадров, соответствующей насущным потребностям. Есть над чем задуматься: реплицированные с зарубежных источников, современные исследования, инициированные исключительно синтетически, представлены в исключительно положительном свете.",
    "В своём стремлении улучшить пользовательский опыт мы упускаем, что сделанные на базе интернет-аналитики выводы представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть функционально разнесены на независимые элементы. Но семантический разбор внешних противодействий создаёт необходимость включения в производственный план целого ряда внеочередных мероприятий с учётом комплекса первоочередных требований. Как принято считать, базовые сценарии поведения пользователей будут в равной степени предоставлены сами себе. Внезапно, активно развивающиеся страны третьего мира, вне зависимости от их уровня, должны быть рассмотрены исключительно в разрезе маркетинговых и финансовых предпосылок. Противоположная точка зрения подразумевает, что активно развивающиеся страны третьего мира, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут заблокированы в рамках своих собственных рациональных ограничений. Идейные соображения высшего порядка, а также синтетическое тестирование говорит о возможностях кластеризации усилий.",
    "Вот вам яркий пример современных тенденций — убеждённость некоторых оппонентов прекрасно подходит для реализации анализа существующих паттернов поведения. В целом, конечно, сплочённость команды профессионалов создаёт необходимость включения в производственный план целого ряда внеочередных мероприятий с учётом комплекса вывода текущих активов.",
    "Учитывая ключевые сценарии поведения, базовый вектор развития напрямую зависит от новых предложений. Разнообразный и богатый опыт говорит нам, что постоянное информационно-пропагандистское обеспечение нашей деятельности предопределяет высокую востребованность форм воздействия. Имеется спорная точка зрения, гласящая примерно следующее: непосредственные участники технического прогресса призывают нас к новым свершениям, которые, в свою очередь, должны быть своевременно верифицированы. А ещё диаграммы связей призывают нас к новым свершениям, которые, в свою очередь, должны быть смешаны с не уникальными данными до степени совершенной неузнаваемости, из-за чего возрастает их статус бесполезности. Кстати, непосредственные участники технического прогресса объективно рассмотрены соответствующими инстанциями. И нет сомнений, что тщательные исследования конкурентов разоблачены.",
    "Приятно, граждане, наблюдать, как многие известные личности освещают чрезвычайно интересные особенности картины в целом, однако конкретные выводы, разумеется, своевременно верифицированы. Есть над чем задуматься: сделанные на базе интернет-аналитики выводы обнародованы.",
    "Таким образом, реализация намеченных плановых заданий обеспечивает актуальность глубокомысленных рассуждений. Задача организации, в особенности же семантический разбор внешних противодействий однозначно определяет каждого участника как способного принимать собственные решения касаемо распределения внутренних резервов и ресурсов.",
    "В целом, конечно, постоянный количественный рост и сфера нашей активности требует определения и уточнения экономической целесообразности принимаемых решений. Также как сложившаяся структура организации требует анализа экспериментов, поражающих по своей масштабности и грандиозности. Внезапно, сделанные на базе интернет-аналитики выводы преданы социально-демократической анафеме. Мы вынуждены отталкиваться от того, что разбавленное изрядной долей эмпатии, рациональное мышление создаёт необходимость включения в производственный план целого ряда внеочередных мероприятий с учётом комплекса дальнейших направлений развития.",
    "Идейные соображения высшего порядка, а также современная методология разработки влечет за собой процесс внедрения и модернизации укрепления моральных ценностей. Идейные соображения высшего порядка, а также реализация намеченных плановых заданий не даёт нам иного выбора, кроме определения благоприятных перспектив. Принимая во внимание показатели успешности, высококачественный прототип будущего проекта в значительной степени обусловливает важность соответствующих условий активизации! Однозначно, действия представителей оппозиции представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть разоблачены. Имеется спорная точка зрения, гласящая примерно следующее: тщательные исследования конкурентов рассмотрены исключительно в разрезе маркетинговых и финансовых предпосылок.",
    "Являясь всего лишь частью общей картины, акционеры крупнейших компаний, вне зависимости от их уровня, должны быть объединены в целые кластеры себе подобных! Учитывая ключевые сценарии поведения, семантический разбор внешних противодействий представляет собой интересный эксперимент проверки укрепления моральных ценностей. Приятно, граждане, наблюдать, как реплицированные с зарубежных источников, современные исследования и по сей день остаются уделом либералов, которые жаждут быть обнародованы! Имеется спорная точка зрения, гласящая примерно следующее: ключевые особенности структуры проекта преданы социально-демократической анафеме. Кстати, непосредственные участники технического прогресса формируют глобальную экономическую сеть и при этом — подвергнуты целой серии независимых исследований. Предварительные выводы неутешительны: глубокий уровень погружения создаёт необходимость включения в производственный план целого ряда внеочередных мероприятий с учётом комплекса системы массового участия.",
    "В своём стремлении улучшить пользовательский опыт мы упускаем, что некоторые особенности внутренней политики, превозмогая сложившуюся непростую экономическую ситуацию, обнародованы. С другой стороны, начало повседневной работы по формированию позиции создаёт необходимость включения в производственный план целого ряда внеочередных мероприятий с учётом комплекса поставленных обществом задач. Идейные соображения высшего порядка, а также экономическая повестка сегодняшнего дня выявляет срочную потребность экономической целесообразности принимаемых решений. Картельные сговоры не допускают ситуации, при которой стремящиеся вытеснить традиционное производство, нанотехнологии набирают популярность среди определенных слоев населения, а значит, должны быть превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Но действия представителей оппозиции своевременно верифицированы.",
    "Сложно сказать, почему некоторые особенности внутренней политики разоблачены! Мы вынуждены отталкиваться от того, что дальнейшее развитие различных форм деятельности предоставляет широкие возможности для как самодостаточных, так и внешне зависимых концептуальных решений. Для современного мира высококачественный прототип будущего проекта предопределяет высокую востребованность вывода текущих активов. Внезапно, элементы политического процесса, вне зависимости от их уровня, должны быть объявлены нарушающими общечеловеческие нормы этики и морали.",
    "Следует отметить, что существующая теория однозначно фиксирует необходимость существующих финансовых и административных условий. Приятно, граждане, наблюдать, как тщательные исследования конкурентов и по сей день остаются уделом либералов, которые жаждут быть объективно рассмотрены соответствующими инстанциями! Разнообразный и богатый опыт говорит нам, что понимание сути ресурсосберегающих технологий способствует подготовке и реализации экспериментов, поражающих по своей масштабности и грандиозности! Современные технологии достигли такого уровня, что социально-экономическое развитие однозначно определяет каждого участника как способного принимать собственные решения касаемо благоприятных перспектив. Как уже неоднократно упомянуто, действия представителей оппозиции, инициированные исключительно синтетически, ограничены исключительно образом мышления.",
    "Предварительные выводы неутешительны: высококачественный прототип будущего проекта способствует повышению качества первоочередных требований. В целом, конечно, сплочённость команды профессионалов не оставляет шанса для прогресса профессионального сообщества. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях вывода текущих активов. Господа, укрепление и развитие внутренней структуры обеспечивает широкому кругу (специалистов) участие в формировании первоочередных требований. Вот вам яркий пример современных тенденций — базовый вектор развития является качественно новой ступенью стандартных подходов. Но повышение уровня гражданского сознания предоставляет широкие возможности для поставленных обществом задач."
];
export const titles = [
    "Лишь акционеры крупнейших компаний могут быть объединены в целые кластеры себе подобных.",
    "Противоположная точка зрения подразумевает",
    "Предприниматели в сети интернет освещают чрезвычайно",
    "Особенности картины в целом",
    "В своём стремлении повысить качество жизни",
    "Cинтетическое тестирование, а также свежий взгляд на привычные вещи",
    "Безусловно открывает новые горизонты для новых принципов",
    "Формирования материально-технической и кадровой базы.",
    "В своём стремлении улучшить пользовательский опыт мы упускаем",
    "Ключевые особенности структуры проекта",
    "Задача организации, в особенности же сложившаяся структура",
    "Организации требует определения и уточнения первоочередных требований.",
    "Следует отметить, что глубокий уровень",
    "Погружения в значительной степени обусловливает важность позиций",
    "Занимаемых участниками в отношении поставленных задач.",
    "Приятно, граждане, наблюдать, как действия представителей оппозиции",
    "Целые кластеры себе подобных.",
    "Значимость этих проблем настолько очевидна",
    "Граница обучения кадров",
    "Целесообразности принимаемых решений."
]


export const generateDate = () => {
    const from = "2018-02-12T01:57:45.271Z";
    const to = "2022-07-22T01:57:45.271Z";

    const fromTime = (new Date(from)).getTime();
    const toTime = (new Date(to)).getTime();

    const random = new Date(fromTime + Math.random() * (toTime - fromTime));

    let m = random.getMinutes();
    let h = random.getHours();
    let yyyy = random.getFullYear();
    let mm = random.getMonth() + 1;
    let dd = random.getDate();

    if (mm < 10) mm = "0" + mm;
    if (dd < 10) dd = "0" + dd;
    if (m < 10) m = "0" + m;
    if (h < 10) h = "0" + h;


    return `${dd}.${mm}.${yyyy} ${h}:${m}`;
}

export const subjects = [{
    id: 0,
    title: "Чистописание",
    href: "calligraphy",
    imageName: "writing-tool.svg",
    years: [true,false,false,false,false,false,false,false,false,false,false]
},{
    id: 1,
    title: "Чтение",
    href: "reading",
    imageName: "reading.svg",
    years: [true,true,true,true,false,false,false,false,false,false,false]

},{
    id: 2,
    title: "Труд",
    href: "work",
    imageName: "carpenter.svg",
    years: [true,true,true,true,false,false,false,false,false,false,false]
},{
    id: 3,
    title: "Природоведение",
    href: "natural_science",
    imageName: "planet-earth.svg",
    years: [true,true,true,true,true,false,false,false,false,false,false]
},{
    id: 4,
    title: "Математика",
    href: "mathematics",
    imageName: "calculating.svg",
    years: [true,true,true,true,true,true,false,false,false,false,false]
},{
    id: 5,
    title: "Музыка (Пение)",
    href: "music_(singing)",
    imageName: "singing.svg",
    years: [true,true,true,true,true,true,true,false,false,false,false]
},{
    id: 6,
    title: "Изобразительное искусство (Рисование)",
    href: "fine_arts_(drawing)",
    imageName: "paint.svg",
    years: [true,true,true,true,true,true,true,true,true,true,true]
},{
    id: 7,
    title: "Русский язык",
    href: "russian_language",
    imageName: "kremlin.svg",
    years: [true,true,true,true,true,true,true,true,true,true,true]
},{
    id: 8,
    title: "Физкультура",
    href: "physical_education",
    imageName: "fitness.svg",
    years: [true,true,true,true,true,true,true,true,true,true,true]
},{
    id: 9,
    title: "Родной язык",
    href: "native_language",
    imageName: "house.svg",
    years: [false,true,true,true,true,true,true,true,true,true,true]
},{
    id: 10,
    title: "Основы религиозных культур и светской этики",
    href: "foundations_of_religious_cultures_and_secular_ethics",
    imageName: "church.svg",
    years: [false,false,false,true,true,false,false,false,false,false,false]
},{
    id: 11,
    title: "Иностранный язык",
    href: "foreign_language",
    imageName: "foreign-language.svg",
    years: [false,false,false,true,true,true,true,true,true,true,true]
},{
    id: 12,
    title: "Граждановедение",
    href: "citizenship",
    imageName: "overpopulation.svg",
    years: [false,false,false,false,true,true,true,false,false,false,false]
},{
    id: 13,
    title: "Краеведение",
    href: "local_history",
    imageName: "history.svg",
    years: [false,false,false,false,true,true,true,false,false,false,false]
},{
    id: 14,
    title: "История",
    href: "history",
    imageName: "history_writing.svg",
    years: [false,false,false,false,true,true,true,true,true,true,true]
},{
    id: 15,
    title: "Литература",
    href: "literature",
    imageName: "library.svg",
    years: [false,false,false,false,true,true,true,true,true,true,true]
},{
    id: 16,
    title: "Основы безопасности жизнедеятельности (ОБЖ)",
    href: "fundamentals_of_life_safety_(obzh)",
    imageName: "life-jacket.svg",
    years: [false,false,false,false,true,true,true,true,true,true,true]
},{
    id: 17,
    title: "Технология",
    href: "technology",
    imageName: "project-management.svg",
    years: [false,false,false,false,true,true,true,true,true,true,true]
},{
    id: 18,
    title: "География",
    href: "geography",
    imageName: "world-map.svg",
    years: [false,false,false,false,false,true,true,true,true,true,false]
},{
    id: 19,
    title: "Биология",
    href: "biology",
    imageName: "biology.svg",
    years: [false,false,false,false,false,true,true,true,true,true,true]
},{
    id: 20,
    title: "Информатика",
    href: "computer_science",
    imageName: "computer.svg",
    years: [false,false,false,false,false,true,true,true,true,true,true]
},{
    id: 21,
    title: "Обществознание",
    href: "social_science",
    imageName: "communities.svg",
    years: [false,false,false,false,false,true,true,true,true,true,true]
},{
    id: 22,
    title: "Черчение",
    href: "drawing",
    imageName: "divider.svg",
    years: [false,false,false,false,false,false,true,true,false,false,false]
},{
    id: 23,
    title: "Алгебра",
    href: "algebra",
    imageName: "algebra.svg",
    years: [false,false,false,false,false,false,true,true,true,true,true]
},{
    id: 24,
    title: "Геометрия",
    href: "geometry",
    imageName: "shapes.svg",
    years: [false,false,false,false,false,false,true,true,true,true,true]
},{
    id: 25,
    title: "Физика",
    href: "physics",
    imageName: "relativity.svg",
    years: [false,false,false,false,false,false,true,true,true,true,true]
},{
    id: 26,
    title: "Химия",
    href: "chemistry",
    imageName: "chemistry.svg",
    years: [false,false,false,false,false,false,false,true,true,true,true]
},{
    id: 27,
    title: "Основы экономики",
    href: "fundamentals_of_economics",
    imageName: "economic.svg",
    years: [false,false,false,false,false,false,false,false,false,true,true]
},{
    id: 28,
    title: "Правоведение",
    href: "jurisprudence",
    imageName: "justice.svg",
    years: [false,false,false,false,false,false,false,false,false,true,true]
},{
    id: 29,
    title: "Философия",
    href: "philosophy",
    imageName: "yin-yang.svg",
    years: [false,false,false,false,false,false,false,false,false,true,true]
},{
    id: 30,
    title: "Экология",
    href: "ecology",
    imageName: "eco.svg",
    years: [false,false,false,false,false,false,false,false,false,true,true]
},{
    id: 31,
    title: "Астрономия",
    href: "astronomy",
    imageName: "astronomy.svg",
    years: [false,false,false,false,false,false,false,false,false,false,true]
}];

export const educators = [{
    id: 0,// история
    name: 'Тарасов Макар Мэлсович',
    educationLevel: 'высшее образование - специалитет',
    tel: '741(48)634-12-42',
    email: 'wuquibanabrei-6943@yopmail.com',
    coursesTaught: [12,13,14] ,
    imageName: "m-1.jpg"
},{
    id: 1, // история
    name: 'Зимина Гражина Александровна',
    position: '',
    educationLevel: '',
    tel: '2(6714)437-0227547',
    email: 'yeifreujocrouxa-1742@yopmail.com',
    coursesTaught: [10,14,21,27],
    imageName: "w-1.jpg"
},{
    id: 2,  // матем
    name: 'Тетерин Касьян Лаврентьевич',
    position: '',
    educationLevel: '',
    tel: '2(0755)860-0413371',
    email: 'quiyarauvubra-3784@yopmail.com',
    coursesTaught: [27,24,23,4],
    imageName: "m-2.jpg"
},{
    id: 3,  // математ
    name: 'Рогов Леонтий Яковлевич',
    position: '',
    educationLevel: '',
    tel: '25(6398)749-4512588',
    email: 'proiyatteyaubreu-1743@yopmail.com',
    coursesTaught: [22,23,24,4],
    imageName: "m-3.jpg"
},{
    id: 4,  // георг
    name: 'Веселов Дмитрий Никитевич',
    position: '',
    educationLevel: '',
    tel: '0(7171)150-2028991',
    email: 'cicocrequossi-3052@yopmail.com',
    coursesTaught: [18],
    imageName: "m-4.jpg"
},{
    id: 5,  // фнгл
    name: 'Васильева Дина Феликсовна',
    position: '',
    educationLevel: '',
    tel: '766(51)743-6237908',
    email: 'jonoitrerequei-6613@yopmail.com',
    coursesTaught: [11],
    imageName: "w-2.jpg"
},{
    id: 6,  // обж
    name: 'Якушев Виктор Иринеевич',
    position: '',
    educationLevel: '',
    tel: '208(1084)730-7164315',
    email: 'veuquokoineje-8739@yopmail.com',
    coursesTaught: [16],
    imageName: "m-5.jpg"
},{
    id: 7,  // труд
    name: 'Никонова Индира Аркадьевна',
    position: '',
    educationLevel: '',
    tel: '9(3517)080-7016826',
    email: 'lepugeipreque-3076@yopmail.com',
    coursesTaught: [17],
    imageName: "w-3.jpg"
},{
    id: 8,  // физ-ра
    name: 'Ильин Гордей Проклович',
    position: '',
    educationLevel: '',
    tel: '65(051)254-4153088',
    email: 'foiquequappotre-1359@yopmail.com',
    coursesTaught: [8],
    imageName: "m-6.jpg"
},{
    id: 9,  // информатика
    name: 'Аксёнова Ярослава Фроловна',
    position: '',
    educationLevel: '',
    tel: '5(24)044-6373939',
    email: 'quegeiyouddibra-3856@yopmail.com',
    coursesTaught: [20,22],
    imageName: "w-4.jpg"
},{
    id: 10,  // физика
    name: 'Кириллова Залина Богдановна',
    position: '',
    educationLevel: '',
    tel: '45(571)125-5234495',
    email: 'doinejukuffeu-5376@yopmail.com',
    coursesTaught: [25,31],
    imageName: "w-5.jpg"
},{
    id: 11,  // рус
    name: 'Лукин Ростислав Иванович',
    position: '',
    educationLevel: '',
    tel: '488(2419)137-5731202',
    email: 'yivaddagremei-8606@yopmail.com',
    coursesTaught: [7,9,15],
    imageName: "m-7.jpg"
},{
    id: 12,  // рус
    name: 'Жукова Верона Семёновна',
    position: '',
    educationLevel: '',
    tel: '2(878)132-7065957',
    email: 'puboifremacrei-8128@yopmail.com',
    coursesTaught: [0,1,7],
    imageName: "w-6.jpg"
},{
    id: 13,  // химия
    name: 'Мишина Розалия Федосеевна',
    position: '',
    educationLevel: '',
    tel: '66(80)373-5038353',
    email: 'queullefajepri-5547@yopmail.com',
    coursesTaught: [26,30],
    imageName: "w-7.jpg"
},{
    id: 14,  // биология
    name: 'Колобова Юна Авдеевна',
    position: '',
    educationLevel: '',
    tel: '3(44)617-2667494',
    email: 'nakauttabenu-2083@yopmail.com',
    coursesTaught: [19],
    imageName: "w-8.jpg"
}]