const data = [
    {
        title: 'Чистописание',
    },
    {
        title: 'Чтение',
    },
    {
        title: 'Труд',
    },
    {
        title: 'Природоведение',
    },
    {
        title: 'Математика',
    },
    {
        title: 'Музыка (Пение)',
    },
    {
        title: 'Изобразительное искусство (Рисование)',
    },
    {
        title: 'Русский язык',
    },
    {
        title: 'Физкультура',
    },
    {
        title: 'Родной язык',
    },
    {
        title: 'Основы религиозных культур и светской этики',
    },
    {
        title: 'Иностранный язык',
    },
    {
        title: 'Граждановедение',
    },
    {
        title: 'Краеведение',
    },
    {
        title: 'История',
    },
    {
        title: 'Литература',
    },
    {
        title: 'Основы безопасности жизнедеятельности (ОБЖ)',
    },
    {
        title: 'Технология',
    },
    {
        title: 'География',
    },
    {
        title: 'Биология',
    },
    {
        title: 'Информатика',
    },
    {
        title: 'Обществознание',
    },
    {
        title: 'Черчение',
    },
    {
        title: 'Алгебра',
    },
    {
        title: 'Геометрия',
    },
    {
        title: 'Физика',
    },
    {
        title: 'Химия',
    },
    {
        title: 'Основы экономики',
    },
    {
        title: 'Правоведение',
    },
    {
        title: 'Философия',
    },
    {
        title: 'Экология',
    },
    {
        title: 'Астрономия',
    }
];

export default data;